{
    "version": "https://jsonfeed.org/version/1",
    "title": "Paolo Di Lorenzo Blog",
    "description": "A collection of articles on data, programming, tech, and the world by Paolo Di Lorenzo.",
    "home_page_url": "http://dilorenzo.pl/blog",
    "feed_url": "http://dilorenzo.pl/blog/feeds/all.json",
    "items": [
          {
            "id": "/ios/2018/06/05/ios-photography-workflow/",
            "title": "iOS Photography Workflow"
            "content_html": "<p>Photography is one of my hobbies, complementing my other hobbies of traveling and hiking quite well. The modern smartphone allows anyone to take exceptional photos with little extra cost (though I do have a <a href=\"https://www.nikonusa.com/en/nikon-products/product/dslr-cameras/d3400.html\">Nikon D3400</a> and a few lenses if I need something fancier).</p>\n\n<p>In this article I’m going to list the apps that I use in my photography pipeline, all the way from capturing to publishing. I am by no means an expert photographer (nor have I tested all of the apps in each category) but this is the setup I use if you’re looking for some inspiration.</p>\n\n<p>I welcome any suggestions or feedback on <a href=\"dilorenzopl\">Twitter</a>.</p>\n\n<p>The main steps in my iOS photography are as follows:</p>\n<ol>\n  <li>Capture</li>\n  <li>Manage</li>\n  <li>Edit</li>\n  <li>Publish</li>\n</ol>\n\n<h2 id=\"capture\">Capture</h2>\n<p><img src=\"https://dilorenzo.pl/images/ios-photo-workflow-halide.png\" /></p>\n<h3 id=\"halide\">Halide</h3>\n<p><a href=\"https://itunes.apple.com/us/app/halide-camera/id885697368?mt=8&amp;uo=4&amp;at=1001lxud\">Halide</a> is a relatively new camera app by with a beautiful design and excellent pro features. It allows the user to set the exposure, focus, ISO, and white balance. Recently it added some features that take advantage of depth photography on phones with dual cameras. Most importantly, Halide allows RAW photo capture, which provides the ability to finely edit every aspect of the photo later on. I use Halide for most pictures I take, and have added its widget to the Today screen so I can quickly access it from the lock screen. My biggest issue with Halide is that the photo preview is a bit laggy when planning around, unlike the stock Camera app which is perfectly smooth. This may be a third party app limitation with the camera frameworks on iOS. However this is mostly a non-issue given the functionality and design present in Halide.</p>\n<h3 id=\"camera\">Camera</h3>\n<p>Despite the feature set and design of Halide, it’s difficult to ignore the stock Camera app built into iOS. Since it is built into the lock screen (swipe left) its always going to be the fastest way to take a picture. I use the stock Camera app for all video capture and Live Photos. Occasionally I will use it for photos if I want to take a picture quickly. The biggest downside is that it currently can not capture photos in a RAW format. For this reason I continue to use Halide for most photo capture from my phone.</p>\n\n<h2 id=\"manage\">Manage</h2>\n<p><img src=\"https://dilorenzo.pl/images/ios-photo-workflow-bestphotos.png\" /> <img src=\"https://dilorenzo.pl/images/ios-photo-workflow-metapho.png\" /></p>\n<h3 id=\"best-photos\">Best Photos</h3>\n<p><a href=\"https://itunes.apple.com/us/app/bestphotos/id1168605247?mt=8&amp;uo=4&amp;at=1001lxud\">Best Photos</a> is a great utility that allows you to quickly filter through all of the photos in your library and delete unneeded ones. It also allows quick favoriting of each as you move through he library.</p>\n<h3 id=\"photos\">Photos</h3>\n<p>The stock Photos app on iOS is the central hub of my photo management workflow. All of my photos are collected in the Photos app and it is from here that I share them to other platforms. I use iCloud Photo Library to sync my photos to all of my devices (iPhone, iPad, Mac, etc.). I also recently purchased a Lightning to SD Card adapter to import DSLR photos right to my iOS devices. This allows me to skip the MacBook Pro altogether as the starting point of the workflow when using the DSLR.</p>\n<h3 id=\"metapho\">Metapho</h3>\n<p><a href=\"https://itunes.apple.com/us/app/metapho/id914457352?mt=8&amp;uo=4&amp;at=1001lxud\">Metapho</a> is a useful utility for reading and editing EXIF data, particularly dates and location. Sometimes a photo will not have a location set (if I forgot to open the <a href=\"https://itunes.apple.com/us/app/snapbridge/id1121563450?mt=8&amp;uo=4&amp;at=1001lxud\">Nikon SnapBridge</a> app that links to my DSLR) and I can use Metapho to set those.</p>\n\n<h2 id=\"edit\">Edit</h2>\n<p><img src=\"https://dilorenzo.pl/images/ios-photo-workflow-darkroom.png\" /> <img src=\"https://dilorenzo.pl/images/ios-photo-workflow-focos.png\" /> <img src=\"https://dilorenzo.pl/images/ios-photo-workflow-vsco.png\" /></p>\n<h3 id=\"darkroom\">Darkroom</h3>\n<p><a href=\"https://itunes.apple.com/us/app/darkroom-photo-editor/id953286746?mt=8&amp;uo=4&amp;at=1001lxud\">Darkroom</a> is my most used photo editing app on iOS. It provides lots of attributes that can be edited in RAW photos, including RGB curves and edits by color. It is closely integrated with Halide and and contains a button to open Halide if it’s installed (Halide also has a button to open Darkroom). It also offers a lot of great filters and the ability to save more to edit future photos in a similar style.</p>\n<h3 id=\"focos\">Focos</h3>\n<p><a href=\"https://itunes.apple.com/us/app/focos/id1274938524?mt=8&amp;uo=4&amp;at=1001lxud\">Focos</a> is an app centered around editing photos with depth maps, specifically those taken with Portrait Mode on iOS. <sup id=\"fnref:1\"><a href=\"#fn:1\" class=\"footnote\">1</a></sup> It features lots of different camera lens and effects to change the look of the background bokeh and also to visualize the depth maps. You can even separately edit and adjust the background and foreground within the depth map. I don’t use it too often but when I have a portrait photo I will open it in Focos to see if I can improve its look.</p>\n<h3 id=\"vsco\">VSCO</h3>\n<p>I will occasionally open a photo in <a href=\"https://itunes.apple.com/us/app/vsco/id588013838?mt=8&amp;uo=4&amp;at=1001lxud\">VSCO</a> for editing. VSCO has one of the most comprehensive filter libraries of any apps I’ve seen and they work well for certain photos so I make it a point to jump in every now and then to see what I can create.</p>\n\n<h2 id=\"publish\">Publish</h2>\n<p><img src=\"https://dilorenzo.pl/images/ios-photo-workflow-instagram.png\" /> <img src=\"https://dilorenzo.pl/images/ios-photo-workflow-vsco.png\" /></p>\n<h3 id=\"instagram\">Instagram</h3>\n<p>I usually post a selection of my final edited photos to <a href=\"https://itunes.apple.com/us/app/instagram/id389801252?mt=8&amp;uo=4&amp;at=1001lxud\">Instagram</a>. I usually post around one photo per month currently but I’m hoping to increase the frequency, especially now that I’ve tabulated my entire workflow. I share photos to Instagram directly from the Photos app using the share sheet. I have disabled camera, microphone, and photos access for Instagram for privacy reasons but sharing directly from Photos still works. I then edit the photo to add a location within Instagram. My VSCO page is <a href=\"https://instagr.am/_dilorenzopl\">@_dilorenzopl</a>.</p>\n<h3 id=\"vsco-1\">VSCO</h3>\n<p>I will occasionally post some more experimental photos to <a href=\"https://itunes.apple.com/us/app/vsco/id588013838?mt=8&amp;uo=4&amp;at=1001lxud\">VSCO</a>. This is still public but has much lower traffic than Instagram so I use it as a space to test certain styles and editing techniques but still have the results available for viewing. My VSCO page is <a href=\"https://vsco.co/pld\">@pld</a>.</p>\n\n<h2 id=\"extras\">Extras</h2>\n<p><img src=\"https://dilorenzo.pl/images/ios-photo-workflow-clips.png\" /> <img src=\"https://dilorenzo.pl/images/ios-photo-workflow-slow-shutter.png\" /> <img src=\"https://dilorenzo.pl/images/ios-photo-workflow-hyperlapse.png\" /> <img src=\"https://dilorenzo.pl/images/ios-photo-workflow-imovie.png\" /> <img src=\"https://dilorenzo.pl/images/ios-photo-workflow-swipeable.png\" />\nThis list contains some apps that I don’t regularly use but do have some nice features for the special instances in which they are useful.</p>\n<h3 id=\"clips\">Clips</h3>\n<p><a href=\"https://itunes.apple.com/us/app/clips/id1212699939?mt=8&amp;uo=4&amp;at=1001lxud\">Clips</a> was an interesting surprise when first released with iOS 10.3. It allows you to cleverly stitch together video clips and photos and overlay them with tons of effects, filters, and text. I haven’t made any full videos with it yet but it is fun to take out when on a hike or trip and just capture snippets of moments for reminiscing later on.</p>\n<h3 id=\"slow-shutter\">Slow Shutter</h3>\n<p>I’ve had <a href=\"https://itunes.apple.com/us/app/slow-shutter-cam/id357404131?mt=8&amp;uo=4&amp;at=1001lxud\">Slow Shutter</a> on my phone for quite some time, at least 4-5 years. It allows you to record long exposure shots with the phone. It essentially captures a short video and then overlays the differences between the frames to create a nice blurred effect (assuming the phone wasn’t moved during capture). This app is best used with a tripod or spot you can lean the phone against. Since iOS 11 was released however, I’ve been mostly using the long exposure Live Photo effect in the Photos app.</p>\n<h3 id=\"imovie\">iMovie</h3>\n<p><a href=\"https://itunes.apple.com/us/app/imovie/id377298193?mt=8&amp;uo=4&amp;at=1001lxud\">iMovie</a> is my video editor of choice, since it’s free and simple. I don’t usually record and edit video but when I need to string a few clips together and add some effects it gets the job done. It was <a href=\"https://twitter.com/dilorenzopl/status/984543207634718722\">finally</a> updated to support the full iPhone X screen size.</p>\n<h3 id=\"hyperlapse\">Hyperlapse</h3>\n<p><a href=\"https://itunes.apple.com/us/app/hyperlapse-from-instagram/id740146917?mt=8&amp;uo=4&amp;at=1001lxud\">Hyperlapse</a> is a simple app by Instagram that allows the user to take time-lapses. The UI is dead simple and the only options are front or back camera and the speed of the time-lapse once its recorded. I find that it makes smoother videos than the built-in Camera app’s time-lapse functionality. I <a href=\"https://instagram.com/p/BYE7GxHgBTa/\">recorded a landscape during the August 2017 total solar eclipse</a> using Hyperlapse.</p>\n<h3 id=\"swipeable\">Swipeable</h3>\n<p><a href=\"https://itunes.apple.com/us/app/swipeable-instagram-panorama/id1209900326?mt=8&amp;uo=4&amp;at=1001lxud\">Swipeable</a> is a utility app that lets the user split a panorama into multiple images for easy sharing on Instagram. There’s an example on <a href=\"https://instagram.com/p/BaUGpTtAndi/\">my Instagram page</a> (swipe to see the whole panorama).</p>\n\n<h2 id=\"some-final-tips\">Some Final Tips</h2>\n<ul>\n  <li>When traveling and taking photos, feel free to use Airplane Mode to save battery. Since iOS 8.3, the GPS still works on iPhone if Airplane Mode is on. I recently discovered this and it has helped greatly. <sup id=\"fnref:2\"><a href=\"#fn:2\" class=\"footnote\">2</a></sup></li>\n  <li>Nowadays you don’t need expensive equipment to take great photos if you already have any iPhone made in the last 5 years. Most of the actions described in this article can be done with the built in Camera and Photos app so if you have any interest, there’s nothing stopping you from getting out there and creating great photos.</li>\n  <li>If you do have a DSLR or other external camera, get a <a href=\"https://www.amazon.com/dp/B0744JB6KR\">Lightning-to-SD Card adapter</a> so you can import your photos right into the Photos app (and continue with the rest of the workflow directly).</li>\n</ul>\n\n<hr />\n\n<div class=\"footnotes\">\n  <ol>\n    <li id=\"fn:1\">\n      <p>Darkroom just added depth editing in their <a href=\"https://itunes.apple.com/us/app/darkroom-photo-editor/id953286746?mt=8\">latest update</a> so I am eager to see how it works and compares to Focos. <a href=\"#fnref:1\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n    <li id=\"fn:2\">\n      <p>I learned this on <a href=\"https://www.relay.fm/query/19\">episode 19 of Query</a>. <a href=\"#fnref:2\" class=\"reversefootnote\">&#8617;</a></p>\n    </li>\n  </ol>\n</div>",
            "date_published": "2018-06-05 16:44:29 +0000",
            "url": "https://dilorenzo.pl/ios/2018/06/05/ios-photography-workflow/"
          },
    
          {
            "id": "/ios/2017/11/12/developing-foodease/",
            "title": "Developing FoodEase"
            "content_html": "<p>Just over five weeks ago, I released my first iPhone app, <a href=\"https://foodease.xyz\">FoodEase</a> to the App Store. I haven’t written any formal blog posts since then so I thought it might be a good idea to lay out my thoughts and vision for FoodEase, as well as what led to its creation.</p>\n\n<h2 id=\"born-in-charleston-sc\">Born in Charleston, SC</h2>\n<p>Right after Christmas 2016, my girlfriend and I took a road trip down to South Carolina to get away from the harsh northern weather and experience a new place. Charleston was a beautiful little city with countless things to do and places to see. One thing that struck me was the abundance of highly rated eateries in such a concentrated downtown area. Answering the timeless travel question “where should we eat next?” became a constant bottleneck in deciding how we spent our day. Much time was wasted perusing the available dining options in Google Maps or Yelp before we decided on a place to eat.</p>\n\n<table class=\"centered\">\n  <tr>\n    <td><a href=\"https://dilorenzo.pl/images/google_maps_example.png\"><img src=\"https://dilorenzo.pl/images/google_maps_example.png\" width=\"200\" alt=\"Google Maps Example\" /></a></td>\n    <td><a href=\"https://dilorenzo.pl/images/yelp_example.png\"><img src=\"https://dilorenzo.pl/images/yelp_example.png\" width=\"200\" alt=\"Yelp Example\" /></a></td>\n  </tr>\n</table>\n\n<p>One of the great difficulties in deciding where to eat was due to having <em>too many</em> options. Should we have burgers, tacos, Italian, or Chinese food? Something fancy or something more casual? Should we walk there or pick something further and use ride sharing?</p>\n\n<p>Weighing all of these factors at once while staring at a list of unknown places <strong>while</strong> at the same trying to ensure it has good reviews can be overwhelming. This is when the gears began turning which eventually led me to start working on FoodEase: what if there was a way to open an app, and within <em>seconds</em> know where we should eat next? No scrolling through countless locations, no juggling a dozen variables; just open an app, see the place, and go.</p>\n\n<h2 id=\"solving-where-should-we-eat\">Solving “Where should we eat?”</h2>\n<p>This issue seems pretty straightforward at first, but once you begin to map out how this should be implemented, it becomes much more involved.</p>\n\n<p>The following aspects must be considered at a minimum:</p>\n<ul>\n  <li>Where is the user, and what’s nearby?</li>\n  <li>What time is it during the day?</li>\n  <li>What is the user’s budget?</li>\n  <li>Does the user have any dietary restrictions?</li>\n  <li>What kind of food does the user like?</li>\n</ul>\n\n<p>Obtaining the first four bullet points is pretty straightforward with modern smartphones:</p>\n<ul>\n  <li>Request the user’s GPS location and use a public places API (examples include <a href=\"https://developers.google.com/places/\">Google Places</a>, <a href=\"https://api.yelp.com\">Yelp</a>, and <a href=\"https://developer.foursquare.com\">Foursquare</a>).</li>\n  <li>Get the current time from the user’s device.</li>\n  <li>Have settings in-app for various elements such as budget and dietary restrictions.</li>\n</ul>\n\n<p>The fifth point is the most challenging to solve, but also the most important. People’s eating preferences vary greatly and the selection that exists in types of restaurants is enormous (Yelp’s <a href=\"https://www.yelp.com/developers/documentation/v2/category_list\">category list</a> contains over 200 types of food and restaurant places alone!). The blending of user settings, environment, and eating preferences to quickly produce a result is at the core of the FoodEase user experience. This is possible with the implementation of the FoodEase Recommendation Engine.</p>\n\n<h2 id=\"the-foodease-recommendation-engine\">The FoodEase Recommendation Engine</h2>\n<p>The FoodEase Recommendation Engine is the set of algorithms that provide the user with a list of places. The main drivers of place suggestions are the <a href=\"https://www.yelp.com/developers/documentation/v2/category_list\">categories</a>  assigned to places on Yelp. These categories provide the most granular, unique representation of a place while still being broad enough for general categorization. Using the categories (as opposed to say, the actual place itself) is useful because of the idea that if a user likes a place with certain categories, there is a chance that they would like a completely different place that had the same exact categories. This of course, is not always true but using a long-term average, one can assume that this would be the case.</p>\n\n<p>Therefore, with each action the user takes (Thumbs Up to select, Thumbs Down to reject, and Arriving at the selected place), the categories of the place in question are given a positive or negative score. If the categories already exist in the database, the category’s score is increased or decreased. Whenever a new Yelp API query is performed, the categories of the results are matched against the category scores in the user’s database. These scores are then adjusted, normalized, and probabilistically sorted. I decided to use a probabilisitic sorting method rather than a purely hierarchical sorting method. The reason is that if the user were to keep using the app in the same location and selecting the suggestion that came up first each time, the first suggestion’s category scores would eventually become so high that the user would never see a different place first. This way, there is always a chance that the user sees a new place, even if it’s not their absolute favorite type of place.</p>\n\n<p>The category scores do not come into play until the <a href=\"https://api.yelp.com\">Yelp API’s</a> results are returned however. Initially, the recommendation engine must build the query that is submitted to the Yelp API. The API call is largely generated from the user’s settings and location (i.e. time of day, coordinates, price range settings, dietary restrictions, etc.). Once the results are returned, we move forward with the category score sorting.</p>\n\n<p>This is the basic idea behind how the recommendation engine works. I will not divulge the exact implementation details behind the algorithms here but perhaps I will explore them further in future blog posts.</p>\n\n<h2 id=\"smooth-reachable-design\">Smooth, reachable design</h2>\n<p>The “brain” behind the recommendations would be useless without a visually appealing user interface to display results. The focus for developing the interface of FoodEase relied on creating a relatively fresh design that can easily be used with one hand, regardless of screen size. All main actions within FoodEase can be performed by constraining any touches to the bottom half of the screen. This is especially helpful in the context that this app would mainly be used: while navigating a busy street to reach a destination.</p>\n\n<table class=\"centered\">\n  <tr>\n    <td><a href=\"https://dilorenzo.pl/images/foodease_main.png\"><img src=\"https://dilorenzo.pl/images/foodease_main.png\" width=\"200\" alt=\"Main Screen\" /></a></td>\n    <td><a href=\"https://dilorenzo.pl/images/foodease_map.png\"><img src=\"https://dilorenzo.pl/images/foodease_map.png\" width=\"200\" alt=\"Map Screen\" /></a></td>\n    <td><a href=\"https://dilorenzo.pl/images/foodease_settings.png\"><img src=\"https://dilorenzo.pl/images/foodease_settings.png\" width=\"200\" alt=\"Settings Screen\" /></a></td>\n  </tr>\n</table>\n\n<h3 id=\"designed-for-reachability\">Designed for reachability</h3>\n<p>I was especially pleased with my initial decision to pursue a reachable design (circa February 2017) when <a href=\"https://www.apple.com/newsroom/2017/09/the-future-is-here-iphone-x/\">iPhone X was announced</a> in Fall 2017. The new phone boasts a much taller screen than users are used to (at least non-Plus users). The reaction buttons fall in the perfect zone to reach in a one-handed fashion—not too high up but not too low either. The toolbar icons would be the next most used buttons, and they fall along the bottom edge of the screen (no pesky hamburger menus in the upper corners). The map button, which would be the most used toolbar button, can actually be replaced by swiping down anywhere on the <em>entire</em> main screen. This is very convenient for one-handedness. Once on the map screen, the user can return to the main screen by swiping up from the bottom panel (or tapping it) and all of the map manipulation buttons are easily accessible at the bottom left. Inside the slide-up views from the main screen (e.g. Settings or Details) I have implemented a simple, subtle feature which goes a long way to improving one-handed accessibility: the “Done” button is located at the <em>bottom</em> of the screen, not the top where it’s usually found. Moreover, this dismissive “Done” button is available on any of these modal screens, no matter how deep in the navigation hierarchy the user is. This makes it very easy for the user to return to the main screen (which can sometimes be a point of confusion inside modal views).</p>\n\n<h2 id=\"the-road-ahead\">The road ahead</h2>\n<h3 id=\"short-term\">Short Term</h3>\n<p>I have already begun collecting feedback from users since the app launched. The main near-term focus is adding some more basic features while improving the intuitiveness of the UI. I’m considering adding an on-boarding flow displaying how to interact with the Thumbs Up/Down buttons and explaining the basic elements of the app.  I’ve heard complaints that it is not clear that the Thumbs Up/Down buttons need to be held for a duration of time rather than simply tapped. User experience flaws such as these are difficult to predict in the development phase, as I am constantly iterating and using the design myself. Improving the discoverability of features is definitely something I intend to continue as I receive more user feedback.</p>\n<h3 id=\"long-term\">Long Term</h3>\n<p>The ultimate goal for this app is to provide the user with the perfect suggestion 100% of the time, and then providing an elegant experience to navigate to such a place. Of course, with any machine learning based solution, it is almost certainly impossible to achieve such accuracy. However, there are definitely ways to try to get as close to 100%, and it is definitely possible to provide an immersive navigation experience once the user has selected a place. These define my long term goals, and the way we get there is to increase the number of settings, include as many variables as possible (without intruding on user privacy) to determine what places are presented, allow the engine to update based on user actions, and maximize algorithm performance so the user can be on their way quickly. Once the perfect place has been suggested, the user should be able to request a ride or navigate to said place, easily and without leaving the app. That would be the ultimate FoodEase experience.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>If you made it this far through the blog post, I give you my thanks for choosing to experience a slice of this journey with me. This was my first time publishing a major piece of software online and I hope this post shed some light on my thoughts and ideas as it happened. I invite you to send me <em>your</em> thoughts about this story or the app on <a href=\"https://twitter.com/dilorenzopl\">Twitter</a> or by <a href=\"mailto:paolo@dilorenzo.pl\">email</a>.</p>\n\n<p>If FoodEase sounds like something you would enjoy using, please <a href=\"https://foodease.xyz/download\">download it on the App Store</a>, leave a rating &amp; review, and tell a friend!</p>\n",
            "date_published": "2017-11-12 23:30:00 +0000",
            "url": "https://dilorenzo.pl/ios/2017/11/12/developing-foodease/"
          },
    
          {
            "id": "/data/2017/08/15/usmap-v0-2-1/",
            "title": "usmap v0.2.1 released"
            "content_html": "<p><code class=\"highlighter-rouge\">usmap v0.2.1</code> is now available for download on <a href=\"https://cran.r-project.org/package=usmap\">CRAN</a>. This minor update includes bug fixes and documentation improvements.</p>\n\n<p>You can read the full changelog <a href=\"https://github.com/pdil/usmap/releases/tag/v0.2.1\">here</a>.</p>",
            "date_published": "2017-08-15 16:00:00 +0000",
            "url": "https://dilorenzo.pl/data/2017/08/15/usmap-v0-2-1/"
          },
    
          {
            "id": "/meta/2017/06/26/automated-publishing-ios/",
            "title": "Automated publishing with Jekyll and Travis CI on iOS"
            "content_html": "<p>My website/blog that you are currently reading is built using the <a href=\"https://jekyllrb.com\">Jekyll framework</a> and hosted on <a href=\"https://pages.github.com\">Github Pages</a>. Jekyll allows one to define webpage layouts, insert plugins, and automate much of the blog generating process. For example, on my website I have used a <a href=\"https://github.com/recurser/jekyll-plugins/blob/master/generate_categories.rb\">plugin</a> that automatically generates all of the <a href=\"https://dilorenzo.pl/blog/categories\">categories</a> from the written posts. Similarly blog posts have a predefined layout that is used which allows me to focus on writing the content of each post and not worry about making sure each detail of the site (sidebar, CSS, etc.) is consistent throughout. Jekyll has the added benefit of generating a static HTML webpage from your layouts, stylesheets, plugins, and pages which tend to render much faster since there is no dynamic content.</p>\n\n<p>With this power and flexibility comes a cost: in order to generate the webpages from the various files that are used, I need to run the <code class=\"highlighter-rouge\">jekyll build</code> command from the root directory. This compiles the files into a static webpage located in the <code class=\"highlighter-rouge\">/_site</code> folder. The contents of the <code class=\"highlighter-rouge\">/_site</code> folder are pushed to my dedicated <a href=\"https://github.com/pdil/_site\">repository</a> on Github which then hosts the website on Github pages. The files used to generate the website are located in the <a href=\"https://github.com/pdil/website-generator\">website-generator</a> repository.</p>\n\n<p>So how do I build my website if I don’t have access to my laptop with the cloned repo and a terminal to use? This might occur when I’m away from home and need to fix a quick typo. Or perhaps I’m traveling and want to submit a post about my experiences. Enter my workflow, which allows me to update my website from any computer with an internet connection, even an iPhone or iPad.</p>\n\n<h2 id=\"automation-with-travis-ci\">Automation with Travis CI</h2>\n<p><a href=\"https://travis-ci.org\">Travis CI</a> is a continuous integration platform that is free for open source projects. When it is hooked up to a Github repository, it automatically builds the contents of the repo and runs any custom scripts or tests on the code within. The ability to customize settings and run shell scripts makes Travis CI very powerful in automating tasks.</p>\n\n<p>Here are the steps that Travis CI executes for this site:</p>\n\n<ol>\n  <li>\n    <p>Changes to the website are pushed to <a href=\"https://github.com/pdil/website-generator\">pdil/website-generator</a></p>\n  </li>\n  <li>Travis CI automatically begins the build process\n    <ul>\n      <li>The <a href=\"https://github.com/pdil/website-generator/blob/master/.travis.yml\"><code class=\"highlighter-rouge\">.travis.yml</code></a> file lists the settings that Travis is to use, as well as any commands that should be executed before/after the build.</li>\n    </ul>\n  </li>\n  <li>\n    <p>On the Travis CI server we install some Ruby gems that are needed for the build (<code class=\"highlighter-rouge\">jekyll</code>, <code class=\"highlighter-rouge\">html-proofer</code>, and <code class=\"highlighter-rouge\">jekyll-paginate</code>)</p>\n  </li>\n  <li>Run <a href=\"https://github.com/pdil/website-generator/blob/master/scripts/build.sh\"><code class=\"highlighter-rouge\">scripts/build.sh</code></a>\n    <ul>\n      <li><code class=\"highlighter-rouge\">build.sh</code> clones the <code class=\"highlighter-rouge\">pdil/_site</code> repo so that changes to it will be tracked and pushed back to Github</li>\n      <li>Next it runs <code class=\"highlighter-rouge\">jekyll build</code> and checks for any HTML errors with <code class=\"highlighter-rouge\">html-proofer</code></li>\n    </ul>\n  </li>\n  <li>Deploy the generated website by running <a href=\"https://github.com/pdil/website-generator/blob/master/scripts/deploy.sh\"><code class=\"highlighter-rouge\">scripts/deploy.sh</code></a>\n    <ul>\n      <li><code class=\"highlighter-rouge\">deploy.sh</code> switches to the <code class=\"highlighter-rouge\">_site</code> folder, commits the changes, and pushes all of the files to <a href=\"https://github.com/pdil/_site\">pdil/_site</a></li>\n    </ul>\n  </li>\n  <li>\n    <p>Github does all the work by hosting the contents of <code class=\"highlighter-rouge\">pdil/_site</code> on Github pages. The CNAME file points the domain name (<code class=\"highlighter-rouge\">dilorenzo.pl</code>) to the hosted content.</p>\n  </li>\n  <li>I receive a push notification from <a href=\"https://pushover.net\">Pushover</a> indicating that the build was successfully deployed (or that it failed).</li>\n</ol>\n\n<p>That is the basic process by which my website is built, from sending the commit to viewing the content on this page.</p>\n\n<p>Now I’ll briefly talk about the tools I use on iOS to post to this website.</p>\n\n<h2 id=\"publishing-from-ios\">Publishing from iOS</h2>\n\n<p>My workflow for editing and posting to this site on iOS revolve around two main apps.</p>\n\n<h3 id=\"working-copy\">Working Copy</h3>\n<p><a href=\"https://itunes.apple.com/us/app/working-copy-powerful-git-client/id896694807?mt=8&amp;at=1001lxud\" target=\"_blank\">Working Copy</a> is a powerful git client that allows you to create and clone git repositories. I have my <a href=\"https://github.com/pdil/website-generator\"><code class=\"highlighter-rouge\">website-generator</code></a> repository in Working Copy which lets me edit any file in that repo and commit the changes. As soon as the changes are committed, the Travis CI workflow detailed above is kicked off.</p>\n\n<h3 id=\"coda\">Coda</h3>\n<p><a href=\"https://itunes.apple.com/us/app/coda/id500906297?mt=8&amp;at=1001lxud\" target=\"_blank\">Coda</a> is a wonderful code editing app by <a href=\"https://panic.com\" target=\"_blank\">Panic</a>. I use it to edit the files that I keep in Working Copy because of its great features. I especially love the webpage preview tool which lets you see how your content looks before you push.</p>\n\n<h3 id=\"side-by-side\">Side-by-side</h3>\n\n<p>Both Coda and Working Copy are compatible with Webdav servers so anything you edit in Coda immediately appears in Working Copy when the server is running (even if the iPad or iPhone is offline).</p>\n\n<p>Here is an image of these two apps working side-by-side:</p>\n\n<p><a href=\"https://dilorenzo.pl/images/working-copy-coda-workflow.png\"><img src=\"https://dilorenzo.pl/images/working-copy-coda-workflow.png\" alt=\"Working Copy / Coda workflow\" /></a></p>\n\n<p>The iPad is great for this because of its SplitView multitasking feature. I’m excited for iOS 11’s file management and drag-and-drop improvements to help even further.</p>\n\n<p>I use an <a href=\"https://www.apple.com/shop/product/MLA22LL/A/magic-keyboard-us-english?fnode=56\" target=\"_blank\">Apple Magic Keyboard</a> for typing with the iPad.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>The combination of web services and iOS apps really come together to provide a streamlined workflow for publishing blogs using Jekyll. In fact, the blog post you’re reading right now was written from my iPad Air 2! This process could be extended to push the generated website files to any hosting platform that one is using to host their site (such as Amazon S3, Linode, etc.).</p>\n\n<p>If you have any other ideas for improving this workflow or what techniques you use for your own content, tell me on <a href=\"https://twitter.com/dilorenzopl\">Twitter</a>. I’m always looking for ways to improve and am curious about other people’s methods.</p>\n\n<hr />\n\n\n<h2 id=\"links\">Links</h2>\n\n<p>The following links contain services and products that were mentioned earlier in the article, for your reference.</p>\n\n<ul>\n  <li><a href=\"https://github.com/pdil/website-generator\">website-generator repo</a> (contains this all files used to generate this website)</li>\n  <li><a href=\"https://github.com/pdil/_site\">_site repo</a> (contains the generated files that actually present the site)</li>\n  <li><a href=\"https://travis-ci.org\">Travis CI</a> (continuous integration platform)</li>\n  <li><a href=\"https://pushover.net\">Pushover</a> (automated push notification service)</li>\n  <li><a href=\"https://itunes.apple.com/us/app/working-copy-powerful-git-client/id896694807?mt=8&amp;at=1001lxud\">Working Copy</a> (iOS git client)</li>\n  <li><a href=\"https://itunes.apple.com/us/app/coda/id500906297?mt=8&amp;at=1001lxud\">Coda</a> (iOS web development IDE)</li>\n  <li><a href=\"https://www.apple.com/shop/product/MLA22LL/A/magic-keyboard-us-english?fnode=56\">Apple Magic Keyboard</a> (wireless Bluetooth keyboard)</li>\n</ul>",
            "date_published": "2017-06-26 20:30:00 +0000",
            "url": "https://dilorenzo.pl/meta/2017/06/26/automated-publishing-ios/"
          },
    
          {
            "id": "/data/2017/04/29/usmap-v0-2-0/",
            "title": "usmap v0.2.0 released"
            "content_html": "<p>I finally got around to updating usmap to version 0.2.0. This version adds the crucial feature of adding data to your maps so that you can create colorful choropleths. This is done by using the <code>map_with_data</code> function to retrieve a data frame. Alternatively, the <code>plot_usmap</code> function has been updated to allow a <code>data</code> parameter to be defined.\n<br />\nHere is an example of such a plot: <br /></p>\n\n<center><img src=\"https://dilorenzo.pl/images/state-pop-example-w-key.png\" /></center>\n\n<p>This map shows the population of each state as of 2015. The code to create this is as follows:</p>\n\n<figure class=\"highlight\"><pre><code class=\"language-r\" data-lang=\"r\"><span class=\"w\">  </span><span class=\"n\">library</span><span class=\"p\">(</span><span class=\"n\">usmap</span><span class=\"p\">)</span><span class=\"w\">\n  </span><span class=\"n\">library</span><span class=\"p\">(</span><span class=\"n\">ggplot2</span><span class=\"p\">)</span><span class=\"w\">\n\n  </span><span class=\"n\">plot_usmap</span><span class=\"p\">(</span><span class=\"n\">data</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"n\">statepop</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"n\">values</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"s2\">\"pop_2015\"</span><span class=\"p\">)</span><span class=\"w\"> </span><span class=\"o\">+</span><span class=\"w\"> \n    </span><span class=\"n\">scale_fill_continuous</span><span class=\"p\">(</span><span class=\"n\">low</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"s2\">\"white\"</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"n\">high</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"s2\">\"red\"</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"n\">name</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"s2\">\"Population (2015)\"</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"n\">label</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"n\">scales</span><span class=\"o\">::</span><span class=\"n\">dollar</span><span class=\"p\">)</span><span class=\"w\"> </span><span class=\"o\">+</span><span class=\"w\">\n    </span><span class=\"n\">scale_x_continuous</span><span class=\"p\">(</span><span class=\"n\">expand</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"nf\">c</span><span class=\"p\">(</span><span class=\"m\">0</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"m\">0</span><span class=\"p\">))</span><span class=\"w\"> </span><span class=\"o\">+</span><span class=\"w\"> </span><span class=\"n\">scale_y_continuous</span><span class=\"p\">(</span><span class=\"n\">expand</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"nf\">c</span><span class=\"p\">(</span><span class=\"m\">0</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"m\">0</span><span class=\"p\">))</span><span class=\"w\"> </span><span class=\"o\">+</span><span class=\"w\">\n    </span><span class=\"n\">theme</span><span class=\"p\">(</span><span class=\"n\">legend.position</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"s2\">\"right\"</span><span class=\"p\">)</span></code></pre></figure>\n\n<p>As you can see we utilize the extensibility of <code>ggplot2</code> to create a nice map complete with a key.\n<br /><br />\nThe <a href=\"https://cran.r-project.org/web/packages/usmap/vignettes/mapping.html\" target=\"_blank\">mapping vignette</a> has been updated with more examples of the new functionality. Be sure to view the documentation for more help with <code>plot_usmap</code> and <code>map_with_data</code>.</p>\n\n<figure class=\"highlight\"><pre><code class=\"language-r\" data-lang=\"r\"><span class=\"w\">  </span><span class=\"o\">?</span><span class=\"n\">usmap</span><span class=\"o\">::</span><span class=\"n\">plot_usmap</span><span class=\"w\">\n  </span><span class=\"o\">?</span><span class=\"n\">usmap</span><span class=\"o\">::</span><span class=\"n\">map_with_data</span></code></pre></figure>\n\n<hr />\n\n\n<p>More features and fixes will be added soon as I move the package towards a stable 1.0 release. As always please check out the <a href=\"http://github.com/pdil/usmap\" target=\"_blank\">Github repo</a> for more information and to suggest/add new features.</p>",
            "date_published": "2017-04-29 20:20:00 +0000",
            "url": "https://dilorenzo.pl/data/2017/04/29/usmap-v0-2-0/"
          },
    
          {
            "id": "/data/2017/01/30/usmap-released/",
            "title": "usmap released"
            "content_html": "<p>I just released my first R package to <a href=\"http://cran.r-project.org\" target=\"_blank\">CRAN</a>. It’s called <a href=\"http://cran.r-project.org/package=usmap\" target=\"_blank\">usmap</a> and can help you create nice US maps for visualizing countrywide data.</p>\n\n<p>Normally, plotting US maps in R is awkward because Alaska and Hawaii are far from the mainland US. So you either make the rest of the US look small, or omit Alaska and Hawaii entirely.</p>\n\n<p>Here’s an example: <br /></p>\n\n<center><img src=\"https://dilorenzo.pl/images/ugly-usmap.png\" /></center>\n\n<p>Absolutely disgusting.</p>\n\n<p>Let’s try using <code class=\"highlighter-rouge\">usmap</code>:</p>\n\n<figure class=\"highlight\"><pre><code class=\"language-r\" data-lang=\"r\"><span class=\"w\">    </span><span class=\"n\">library</span><span class=\"p\">(</span><span class=\"n\">usmap</span><span class=\"p\">)</span><span class=\"w\">\n    </span><span class=\"n\">plot_usmap</span><span class=\"p\">()</span></code></pre></figure>\n\n<center><img src=\"https://dilorenzo.pl/images/nice-usmap.png\" /></center>\n\n<p>Ah, much better. The map is even drawn using a nicer <a href=\"https://en.wikipedia.org/wiki/Albers_projection\" target=\"_blank\">equal-area projection</a>, rather than the default <a href=\"https://en.wikipedia.org/wiki/Mercator_projection\" target=\"_blank\">Mercator</a> that always seems to be used. You can also plot all the counties of the US with this package and select only certain states/counties to be drawn as well. You can see the county map at the landing page I created for this package by <a href=\"https://dilorenzo.pl/usmap\">clicking here</a>.</p>\n\n<p>The <code class=\"highlighter-rouge\">plot_usmap</code> function returns a <a href=\"https://github.com/tidyverse/ggplot2\" target=\"_blank\"><code class=\"highlighter-rouge\">ggplot</code></a> object, which means you can very easily change the colors, titles, labels, etc. of the plot. See the <a href=\"https://cran.r-project.org/web/packages/usmap/vignettes/mapping.html\" target=\"_blank\">mapping vignette</a> for more details.</p>\n\n<p>There are some convenience methods for working with <a href=\"https://en.wikipedia.org/wiki/FIPS_county_code\" target=\"_blank\">FIPS codes</a>, which is how the states and counties in the package are identified.</p>\n\n<figure class=\"highlight\"><pre><code class=\"language-r\" data-lang=\"r\"><span class=\"w\">    </span><span class=\"n\">fips</span><span class=\"p\">(</span><span class=\"s2\">\"NJ\"</span><span class=\"p\">)</span><span class=\"w\">\n    </span><span class=\"n\">fips</span><span class=\"p\">(</span><span class=\"s2\">\"NJ\"</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"n\">county</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"s2\">\"Mercer\"</span><span class=\"p\">)</span></code></pre></figure>\n\n<p>If you want more information, be sure to check out the <a href=\"http://github.com/pdil/usmap\" target=\"_blank\">Github repository</a> or the vignettes.</p>\n\n<figure class=\"highlight\"><pre><code class=\"language-r\" data-lang=\"r\"><span class=\"w\">    </span><span class=\"n\">vignette</span><span class=\"p\">(</span><span class=\"n\">package</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"s2\">\"usmap\"</span><span class=\"p\">)</span><span class=\"w\">\n    </span><span class=\"n\">vignette</span><span class=\"p\">(</span><span class=\"s2\">\"introduction\"</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"n\">package</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"s2\">\"usmap\"</span><span class=\"p\">)</span><span class=\"w\">\n    </span><span class=\"n\">vignette</span><span class=\"p\">(</span><span class=\"s2\">\"mapping\"</span><span class=\"p\">,</span><span class=\"w\"> </span><span class=\"n\">package</span><span class=\"w\"> </span><span class=\"o\">=</span><span class=\"w\"> </span><span class=\"s2\">\"usmap\"</span><span class=\"p\">)</span></code></pre></figure>\n\n<p>Feel free to fork the repository and submit pull requests with feature changes and fixes, I’m open to any suggestions. This package was a learning experience for me in creating R packages and starting an open source project. I look forward to maintaining it going forward and implementing great new features.</p>\n\n<hr />\n\n\n<p>The code that was used to create these maps was based on this blog post: <a href=\"https://rud.is/b/2014/11/16/moving-the-earth-well-alaska-hawaii-with-r/\" target=\"_blank\">https://rud.is/b/2014/11/16/moving-the-earth-well-alaska-hawaii-with-r/</a>.</p>",
            "date_published": "2017-01-30 03:32:00 +0000",
            "url": "https://dilorenzo.pl/data/2017/01/30/usmap-released/"
          },
    ]
}